SET NAMES UTF8;
DROP DATABASE IF EXISTS iyueQi;
CREATE DATABASE iyueQi CHARSET=UTF8;
USE iyueQi;

CREATE TABLE login(
    uid INT PRIMARY KEY AUTO_INCREMENT,
    uname VARCHAR(16),
    upwd VARCHAR(20)
);
INSERT INTO login VALUES('','uroot','1111');

CREATE TABLE product(
    pid INT PRIMARY KEY AUTO_INCREMENT,
    pname VARCHAR(50),
    ptitle VARCHAR(50),
    oldPic INT,
    newPic INT,
    salNum INT,
    imgUrl VARCHAR(50),
    pClass VARCHAR(10),
    salClass INT
);
-- salClass{1:最新商品,2:精品推荐,3:热卖,outher:none}
INSERT INTO product VALUES
('','41寸民谣高档吉他琴箱','','274','228','51','img/8834.jpg','myjt','2'),
('','专利吉他爱乐器S2红松玫瑰木单板','专利吉他爱乐器S2红松玫瑰木单板 ','2376','1980','1068','img/1061.jpg','myjt','2'),
('','HiLight云杉沙比利民谣吉他','经典HiLight最新款，云杉沙比利面板，缺角，玫瑰木指板，金属头标，哑光，超棒的音色，入门必选！','479','399','335','img/8537.jpg','myjt','2'),
('','凯撒K1C红杉单板吉他','凯撒入驻爱乐器的特价活动琴，全网最低价格，超高性价比，单板入门级首选民谣吉他！','959','799','331','img/8977.jpg','myjt','2'),
('','法丽达 D-52单板吉他','','7390','8868','1','img/5950.jpg','myjt','3'),
('','拉维斯N-980D','','2390','2868','1','img/7633.jpg','myjt','1'),
('','红棉全单古典吉他 实木吉他','','3685','4422','0','img/5581.jpg','gdjt','0'),
('','YAMAHA雅马哈 CG122MCMS','','1590','1908','1','img/3352.jpg','gdjt','1'),
('','琴博士36寸云杉玫瑰木单板旅行','','900','750','54','img/4685.jpg','lxjt','2'),
('','十字军36寸全桃沙比利旅行吉他','十字军36寸全桃花芯木旅行吉他','816','680','22','img/9080.jpg','lxjt','3'),
('','十字军36寸云杉沙比利旅行吉他','十字军36寸全桃花芯木旅行吉他','816','680','12','img/7992.jpg','lxjt','3'),
('','十字军36寸云杉沙比利旅行吉他','十字军36寸云杉玫瑰木旅行吉他，便携旅行特价！','696','580','22','img/6017.jpg','lxjt','3'),
('','泰勒TaylorBT单板旅行民谣吉他','顶级吉他品牌，超级好玩的34寸旅行吉他 有云杉版本BT1 和 桃花心木版本BT2 ，以及RSBT Taylor swift签名款珍藏版~~','2999','2499','1','img/5142.jpg','lxjt','1'),
('','面单板民谣木吉他旅行电箱初学','','778','648','0','img/5683.jpg','lxjt','1'),
('','kaka尤克里里23寸相思木','','552','460','1','img/0415.jpg','ykll','1'),
('','尤克里里 ukulele21 23 26 30寸','','431','359','0','img/3359.jpg','ykll','3'),
('','吉他之声Mauloa 迈诺尔UK10','','586','488','1','img/2660.jpg','ykll','0'),
('','UKU TS-30 23寸尤克里里桃花心单板','','599','499','0','img/5091.jpg','ykll','0'),
('','吉他拾音器贴片爱乐器独家推出','吉他拾音器贴片爱乐器独家推出','36','30','3','img/4512.jpg','gtpj','3'),
('','多功能吉他调音器','这款调音器，使用简便调音准确，吉他夹式自动校音，可调节民谣，古典吉他，电吉他，贝司，小提琴等.','18','15','9','img/4057.jpg','gtpj','3'),
('','特价阿诺玛AC-21金属变调夹','新款变调夹在AC-21的基础上进行研发设计，结构原理基本相同，外观设计更具流线型和美感！','35','17','1','img/4813.jpg','gtpj','3'),
('','音乐理论基础 李重光编著','','19','16','3','img/6500.jpg','yljc','1'),
('','实用乐理 第二次修订版 刘小明 杨晓编','','20','17','1','img/4875.jpg','yljc','0'),
('','民谣吉他考级标准教程书','民谣吉他考级标准教程书','20','17','1','img/1748.jpg','jtjc','3'),
('','Beyond乐队弹唱与独奏吉他','Beyond乐队弹唱与独奏吉他流行弹唱','23','19','1','img/7090.jpg','jtjc','3'),
('','吉他自学三月通入门教程视频教学','全新升级精彩完美版——2014年6月印刷，版本全面升级，内容再次扩充！','48','25','43','img/5177.jpg','jtjc','2'),
('','木吉他独奏','为使仅具备初级入门水平的学习者具备进行木吉他独奏的能力，本书特地设置了训练各种独奏技能和技巧的教程部分。分为认识篇和训练篇两个部分。本书还精选了一部分独具特色的风格体验曲。','34','24','1','img/3419.jpg','jtjc','1'),
('','URBeats二代入耳式','','1018','848','1','img/2012.jpg','gbzej','3'),
('','录音师专业版头戴式DJ耳机','','3118','2598','1','img/7912.jpg','gbzej','3'),
('','铁三角ATH-M40X录音室专用','','828','690','1','img/4440.jpg','gbzej','3'),
('','马歇尔Marshall-HIFI 头戴式语音线控耳机','马赫尔耳机拥有最新的蓝牙连接技术，呈现具有延伸感的高音、自然的中音和强劲的低音。','828','690','1','img/8741.jpg','gbzej','2'),
('','蓝强A-10台式音响笔记本小音箱','','36','30','1','img/4390.jpg','ltyx','0'),
('','My AMP MP3复古高保真音箱低音炮','','119','99','0','img/6993.jpg','ltyx','0'),
('','玛尚MS-308音响多媒体音箱2.1低音炮','','119','99','0','img/9148.jpg','ltyx','0'),
('','得胜pc-k600专业电容麦克风声卡套装','','755','629','0','img/0608.jpg','mk','1'),
('','花喜鹊电容麦 libablue蓝调K 660','','215','179','0','img/4563.jpg','mk','1'),
('','吟飞电子鼓TD-36爵士鼓 电子鼓','','1476','1230','1','img/3364.jpg','dzg','1'),
('','吟飞电子鼓TD-82电架子鼓电鼓','','1896','4580','0','img/7428.jpg','dzg','0'),
('','罗兰/ROLAND可折叠电鼓','','5988','4990','0','img/8857.jpg','dzg','1');

SET CHARSET gbk;